#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"ПрисоединитьДополнительныеТаблицы
	|ЭтотСписок КАК Т
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Т1 
	|	ПО Т.АналитикаУчетаПоПартнерам = Т1.КлючАналитики
	|;
	|РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Т1.Организация)
	|	И ЗначениеРазрешено(Т1.Партнер)";
	
	Ограничение.ТекстДляВнешнихПользователей =
	"ПрисоединитьДополнительныеТаблицы
	|ЭтотСписок КАК ЭтотСписок
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам
	|	ПО АналитикаУчетаПоПартнерам.КлючАналитики = ЭтотСписок.АналитикаУчетаПоПартнерам
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВнешниеПользователи КАК ВнешниеПользователиПартнеры
	|	ПО ВнешниеПользователиПартнеры.ОбъектАвторизации = АналитикаУчетаПоПартнерам.Партнер
	|;
	|РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(ВнешниеПользователиПартнеры.Ссылка)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнформационнойБазы

// Добавляет в список процедуры-обработчики обновления данных ИБ
// для всех поддерживаемых версий библиотеки или конфигурации.
// Вызывается перед началом обновления данных ИБ для построения плана обновления.
//
// Параметры:
// 	Обработчики - см. ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт

	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "РегистрыНакопления.РасчетыСКлиентами.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.Версия = "11.5.18.31";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("489f7d26-6bd5-7943-a55c-3d06d445974a");
	Обработчик.Многопоточный = Истина;
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "РегистрыНакопления.РасчетыСКлиентами.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.Порядок = Перечисления.ПорядокОбработчиковОбновления.Обычный;
	Обработчик.Комментарий = СтрШаблон(НСтр("ru = 'Добавляет записи по увеличению и уменьшению ""К оплате"" в накладные по заказам и по графику договора.
	|Исправляет период движений по ресурсу ""%1"".
	|Удаляет движения по заказам по передаче на хранение в регистре ""Расчеты с клиентами"".
	|Для движения переноса задолженности:
	| - заполняет новые реквизиты ""Объект расчетов приемник"", ""Аналитика учета по партнерам приемник"", ""Сумма приемник""
	| - перезаполняет идентификаторы фин.записи.
	|Очищает движения ресурса ""Оплачивается"" по Заявкам на расходование средств с пустыми объектами расчетов.
	|Исправляет порядок операции движений по ресурсу ""%2""
	|Перезаполняет поле ""Порядок зачета по дате платежа"" для платежных документов.'"), 
	Метаданные.РегистрыНакопления.РасчетыСКлиентами.Ресурсы.КОплате.Представление(),
	Метаданные.РегистрыНакопления.РасчетыСКлиентами.Ресурсы.КОтгрузке.Представление());
	
	Читаемые = Новый Массив;
	Читаемые.Добавить(Метаданные.РегистрыНакопления.РасчетыСКлиентами.ПолноеИмя());
	Читаемые.Добавить(Метаданные.Справочники.ДоговорыКонтрагентов.ПолноеИмя());
	Читаемые.Добавить(Метаданные.Документы.ВзаимозачетЗадолженности.ПолноеИмя());
	Читаемые.Добавить(Метаданные.Документы.ЗаявкаНаРасходованиеДенежныхСредств.ПолноеИмя());
	Обработчик.ЧитаемыеОбъекты = СтрСоединить(Читаемые, ",");
	
	Изменяемые = Новый Массив;
	Изменяемые.Добавить(Метаданные.РегистрыНакопления.РасчетыСКлиентами.ПолноеИмя());
	Обработчик.ИзменяемыеОбъекты = СтрСоединить(Изменяемые, ",");
	
	Блокируемые = Новый Массив;
	Блокируемые.Добавить(Метаданные.РегистрыНакопления.РасчетыСКлиентами.ПолноеИмя());
	Обработчик.БлокируемыеОбъекты = СтрСоединить(Блокируемые, ",");
	
КонецПроцедуры

// Процедура регистрации данных для обработчика обновления ОбработатьДанныеДляПереходаНаВерсию.
// 
// Параметры:
//  Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяРегистра  = "РегистрНакопления.РасчетыСКлиентами";

	ПараметрыВыборки = Параметры.ПараметрыВыборки;
	ПараметрыВыборки.ПолныеИменаРегистров = ПолноеИмяРегистра;
	ПараметрыВыборки.ПоляУпорядочиванияПриРаботеПользователей.Добавить("Период УБЫВ");
	ПараметрыВыборки.ПоляУпорядочиванияПриОбработкеДанных.Добавить("Период УБЫВ");
	ПараметрыВыборки.СпособВыборки = ОбновлениеИнформационнойБазы.СпособВыборкиРегистраторыРегистра();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Регистр.Регистратор КАК Ссылка
	|ПОМЕСТИТЬ ВтНакладныеПоГрафикам
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами КАК Регистр
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|			ПО Аналитика.КлючАналитики = Регистр.АналитикаУчетаПоПартнерам
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК Договоры
	|			ПО Договоры.Ссылка = Аналитика.Договор
	|			И Договоры.ЗаданГрафикИсполнения
	|ГДЕ
	|	Регистр.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И Регистр.КОтгрузке > 0 
	|	И (Регистр.ПродажаПоЗаказу НЕ В (&ПустыеСсылкиНаЗаказы)
	|		ИЛИ Договоры.Ссылка ЕСТЬ НЕ NULL)
	|	И НЕ Регистр.Регистратор ССЫЛКА Документ.КорректировкаРегистров
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор
	|;
	|ВЫБРАТЬ
	|	Накладные.Ссылка КАК Регистратор
	|ИЗ
	|	ВтНакладныеПоГрафикам КАК Накладные
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентами КАК ЗаписиКОплате
	|			ПО ЗаписиКОплате.Регистратор = Накладные.Ссылка
	|				И ЗаписиКОплате.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И ЗаписиКОплате.КОплате > 0
	|				И ЗаписиКОплате.ХозяйственнаяОПерация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиентуРеглУчет)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентами КАК ЗаписиСумм
	|			ПО ЗаписиСумм.Регистратор = Накладные.Ссылка
	|				И ЗаписиСумм.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				И ЗаписиСумм.Сумма > 0
	|ГДЕ
	|	ЗаписиКОплате.Регистратор ЕСТЬ NULL
	|	И (ЗаписиСумм.Регистратор ЕСТЬ НЕ NULL
	|		ИЛИ ВЫРАЗИТЬ(Накладные.Ссылка КАК Документ.РеализацияТоваровУслуг).Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРеализацийТоваровУслуг.ВПути)
	|		ИЛИ ВЫРАЗИТЬ(Накладные.Ссылка КАК Документ.РеализацияУслугПрочихАктивов).Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРеализацийТоваровУслуг.ВПути)
	|		ИЛИ ВЫРАЗИТЬ(Накладные.Ссылка КАК Документ.РеализацияТоваровУслуг).Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРеализацийТоваровУслуг.КПредоплате))
	|
	// исправление кор.аналитики
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами КАК Расчеты
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентами КАК КорРасчеты
	|	ПО Расчеты.Регистратор = КорРасчеты.Регистратор
	|		И Расчеты.КорАналитикаУчетаПоПартнерам = КорРасчеты.АналитикаУчетаПоПартнерам
	|		И Расчеты.КорОбъектРасчетов = КорРасчеты.ОбъектРасчетов
	|ГДЕ
	| 	Расчеты.Регистратор ССЫЛКА Документ.ВзаимозачетЗадолженности
	| 	И Расчеты.КорОбъектРасчетов <> ЗНАЧЕНИЕ(Справочник.ОбъектыРасчетов.ПустаяСсылка)
	|	И КорРасчеты.ОбъектРасчетов ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами КАК Расчеты
	|ГДЕ
	| 	ТИПЗНАЧЕНИЯ(Расчеты.Регистратор) В (ТИП(Документ.ПередачаТоваровМеждуОрганизациями),
	|										ТИП(Документ.ОтчетПоКомиссииМеждуОрганизациями),
	|										ТИП(Документ.ОтчетПоКомиссииМеждуОрганизациямиОСписании),
	|										ТИП(Документ.РасходныйКассовыйОрдер),
	|										ТИП(Документ.СписаниеБезналичныхДенежныхСредств),
	|										ТИП(Документ.ОперацияПоПлатежнойКарте))
	| 	И Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И Расчеты.КОплате > 0
	|	И Расчеты.ИсключатьПриКонтроле = ЛОЖЬ
	|
	// Исправление периода движения "К оплате"
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами КАК Расчеты
	|ГДЕ
	|	Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И Расчеты.КОплате > 0
	|	И НАЧАЛОПЕРИОДА(Расчеты.Период,ДЕНЬ) < НАЧАЛОПЕРИОДА(Расчеты.ДатаРегистратора,ДЕНЬ)
	|	И НЕ Расчеты.Регистратор ССЫЛКА Документ.ВводОстатков
	|	И НЕ Расчеты.Регистратор ССЫЛКА Документ.ВводОстатковВзаиморасчетов
	|
	// Удаление записей по заказам отвественного хранения
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасчетыСКлиентами.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами КАК РасчетыСКлиентами
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
	|			ПО РасчетыСКлиентами.Регистратор = ЗаказКлиента.Ссылка
	|ГДЕ
	|	ЗаказКлиента.ХозяйственнаяОперация = &ХозяйственнаяОперацияПередачаНаХранение
	|
	// Заполнение приемников
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Приемник.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами КАК Приемник
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентами КАК Источник
	|	ПО Приемник.Регистратор = Источник.Регистратор
	|		И Приемник.КорАналитикаУчетаПоПартнерам = Источник.АналитикаУчетаПоПартнерам
	|		И Приемник.КорОбъектРасчетов = Источник.ОбъектРасчетов
	|		И Приемник.ХозяйственнаяОперация = Источник.ХозяйственнаяОперация
	| 		И Приемник.КорОбъектРасчетов <> ЗНАЧЕНИЕ(Справочник.ОбъектыРасчетов.ПустаяСсылка)
	| 		И Источник.НастройкаХозяйственнойОперации <> ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ПустаяСсылка)
	|ГДЕ
	| 	&НоваяАрхитектураВзаиморасчетов
	|	И Приемник.ИдентификаторФинЗаписи <> Источник.ИдентификаторФинЗаписи
	| 	И НЕ Приемник.Регистратор ССЫЛКА Документ.ВзаимозачетЗадолженности
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Расчеты.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами КАК Расчеты
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВзаимозачетЗадолженности КАК Взаимозачеты
	|	ПО Расчеты.Регистратор = Взаимозачеты.Ссылка
	|ГДЕ
	|	&НоваяАрхитектураВзаиморасчетов
	| 	И ЕСТЬNULL(Взаимозачеты.ОбъектРасчетовИнтеркампани,ЗНАЧЕНИЕ(Справочник.ОбъектыРасчетов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ОбъектыРасчетов.ПустаяСсылка)
	|СГРУППИРОВАТЬ ПО
	|	Расчеты.Регистратор
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(Расчеты.КорОбъектРасчетов <> ЗНАЧЕНИЕ(Справочник.ОбъектыРасчетов.ПустаяСсылка)
	|				И Расчеты.КорАналитикаУчетаПоПартнерам <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПоПартнерам.ПустаяСсылка))
	|	И НЕ МАКСИМУМ(Расчеты.ОбъектРасчетовПриемник <> ЗНАЧЕНИЕ(Справочник.ОбъектыРасчетов.ПустаяСсылка)
	|					И Расчеты.АналитикаУчетаПоПартнерамПриемник  <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПоПартнерам.ПустаяСсылка))
	|
	// Очистка ресурса "Оплачивается"
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами КАК Расчеты
	|ГДЕ
	|	Расчеты.Оплачивается <> 0
	|	И (Расчеты.ЗаявкаНаРасходованиеДенежныхСредств В (
	|		ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			ДанныеРасшифровки.Ссылка КАК Ссылка
	|		ИЗ
	|			Документ.ЗаявкаНаРасходованиеДенежныхСредств.РасшифровкаПлатежа КАК ДанныеРасшифровки
	|		ГДЕ
	|			ДанныеРасшифровки.ОбъектРасчетов <> ЗНАЧЕНИЕ(Справочник.ОбъектыРасчетов.ПустаяСсылка)
	|			И ДанныеРасшифровки.ОбъектРасчетов.Объект = Неопределено)
	|		ИЛИ НЕ Расчеты.ЗаявкаНаРасходованиеДенежныхСредств.КонтролироватьОплатуПоОбъектамРасчетов)
	|
	// Перезаполнение поля ПорядокЗачетаПоДатеПлатежа
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами КАК Расчеты
	|ГДЕ
	|	Расчеты.Сумма > 0
	|	И Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И Расчеты.ДатаПлатежа <> ДАТАВРЕМЯ(1,1,1)
	|	И НАЧАЛОПЕРИОДА(Расчеты.ДатаПлатежа,ДЕНЬ) <> НАЧАЛОПЕРИОДА(Расчеты.ДатаРегистратора,ДЕНЬ)
	|	И Расчеты.ПорядокОперации = Расчеты.ПорядокЗачетаПоДатеПлатежа
	|	И Расчеты.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереносЗадолженностиМеждуФилиалами)
	//Исправление порядка операции "КОтгрузке"
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами КАК Расчеты
	|ГДЕ
	|	Расчеты.КОтгрузке <> 0
	|	И НАЧАЛОПЕРИОДА(Расчеты.Период, ДЕНЬ) <> НАЧАЛОПЕРИОДА(Расчеты.ДатаРегистратора, ДЕНЬ)
	|	И ПОДСТРОКА(Расчеты.ПорядокОперации, 0, 8) <> ПОДСТРОКА(Расчеты.ПорядокЗачетаПоДатеПлатежа, 0, 8)
	|	И Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ТИПЗНАЧЕНИЯ(Расчеты.Регистратор) В (ТИП(Документ.ЗаказКлиента),
	|										ТИП(Документ.ЗаявкаНаВозвратТоваровОтКлиента))
	|";
	
	Запрос.УстановитьПараметр("ПустыеСсылкиНаЗаказы", ОперативныеВзаиморасчетыСервер.ПустыеСсылкиНаЗаказы());
	Запрос.УстановитьПараметр("ХозяйственнаяОперацияПередачаНаХранение", Перечисления.ХозяйственныеОперации.ПередачаНаХранениеСПравомПродажи);
	Запрос.УстановитьПараметр("НоваяАрхитектураВзаиморасчетов", ПолучитьФункциональнуюОпцию("НоваяАрхитектураВзаиморасчетов"));
	
	ОбновлениеИнформационнойБазы.ОтметитьРегистраторыКОбработке(
		Параметры, 
		Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Регистратор"),
		ПолноеИмяРегистра);
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяОбъекта = "РегистрНакопления.РасчетыСКлиентами";
	ИмяОбъекта = СтрРазделить(ПолноеИмяОбъекта,".")[1];
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	ПараметрыОбработки = ОбновлениеИнформационнойБазы.СоздатьВременнуюТаблицуРегистраторовРегистраДляОбработки(
		Параметры.Очередь,
		Неопределено, 
		ПолноеИмяОбъекта, 
		МенеджерВременныхТаблиц);
	
	Если НЕ ПараметрыОбработки.ЕстьДанныеДляОбработки Тогда
		Параметры.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	Если НЕ ПараметрыОбработки.ЕстьЗаписиВоВременнойТаблице Тогда
		Параметры.ОбработкаЗавершена = Ложь;
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Регистр.Регистратор КАК Ссылка
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами КАК Регистр
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|			ПО Аналитика.КлючАналитики = Регистр.АналитикаУчетаПоПартнерам
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК Договоры
	|			ПО Договоры.Ссылка = Аналитика.Договор
	|			И Договоры.ЗаданГрафикИсполнения
	|ГДЕ
	|	Регистр.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И Регистр.КОтгрузке > 0 
	|	И (Регистр.ПродажаПоЗаказу НЕ В (&ПустыеСсылкиНаЗаказы)
	|		ИЛИ Договоры.Ссылка ЕСТЬ НЕ NULL)
	|	И Регистр.Регистратор В (ВЫБРАТЬ ВТДляОбработки.Регистратор ИЗ ВТДляОбработки)";
	Запрос.УстановитьПараметр("ПустыеСсылкиНаЗаказы", ОперативныеВзаиморасчетыСервер.ПустыеСсылкиНаЗаказы());
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВТДляОбработки", ПараметрыОбработки.ИмяВременнойТаблицы);
	НакладныеПоГрафикам = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеРегистра.Регистратор КАК Регистратор,
	|
	|	ДанныеРегистра.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ЕСТЬNULL(КлючиАналитики.Организация, НЕОПРЕДЕЛЕНО) КАК Организация,
	|	ЕСТЬNULL(КлючиАналитики.Партнер, НЕОПРЕДЕЛЕНО) КАК Партнер,
	|	ЕСТЬNULL(КлючиАналитики.Контрагент, НЕОПРЕДЕЛЕНО) КАК Контрагент,
	|	ЕСТЬNULL(КлючиАналитики.Договор, НЕОПРЕДЕЛЕНО) КАК Договор,
	|	ЕСТЬNULL(КлючиАналитики.НаправлениеДеятельности, НЕОПРЕДЕЛЕНО) КАК НаправлениеДеятельности,
	|
	|	ДанныеРегистра.КорОбъектРасчетов КАК КорОбъектРасчетов,
	|	ДанныеРегистра.КорАналитикаУчетаПоПартнерам КАК КорАналитикаУчетаПоПартнерам,
	|	ЕСТЬNULL(КорКлючиАналитики.Организация, НЕОПРЕДЕЛЕНО) КАК КорОрганизация,
	|	ЕСТЬNULL(КорКлючиАналитики.Партнер, НЕОПРЕДЕЛЕНО) КАК КорПартнер,
	|	ЕСТЬNULL(КорКлючиАналитики.Контрагент, НЕОПРЕДЕЛЕНО) КАК КорКонтрагент,
	|	ЕСТЬNULL(КорКлючиАналитики.Договор, НЕОПРЕДЕЛЕНО) КАК КорДоговор,
	|	ЕСТЬNULL(КорКлючиАналитики.НаправлениеДеятельности, НЕОПРЕДЕЛЕНО) КАК КорНаправлениеДеятельности
	|ИЗ 
	|	РегистрНакопления.РасчетыСКлиентами КАК ДанныеРегистра
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДляОбработки КАК СсылкиДляОбработки
	|		ПО ДанныеРегистра.Регистратор = СсылкиДляОбработки.Регистратор
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК КлючиАналитики
	|		ПО ДанныеРегистра.АналитикаУчетаПоПартнерам = КлючиАналитики.КлючАналитики
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК КорКлючиАналитики
	|		ПО ДанныеРегистра.КорАналитикаУчетаПоПартнерам = КорКлючиАналитики.КлючАналитики
	|ГДЕ
	| 	ДанныеРегистра.Регистратор ССЫЛКА Документ.ВзаимозачетЗадолженности
	|;
	|
	|ВЫБРАТЬ
	|	СсылкиДляОбработки.Регистратор КАК Регистратор,
	|	СсылкиДляОбработки.Регистратор.Номер КАК РегистраторНомер
	|ИЗ 
	|	ВТДляОбработки КАК СсылкиДляОбработки
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Регистр.Регистратор КАК Ссылка
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами КАК Регистр
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
	|			ПО Регистр.Регистратор = ЗаказКлиента.Ссылка
	|ГДЕ
	|	ЗаказКлиента.ХозяйственнаяОперация = &ХозяйственнаяОперацияПередачаНаХранение
	|	И Регистр.Регистратор В (ВЫБРАТЬ ВТДляОбработки.Регистратор ИЗ ВТДляОбработки)";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВТДляОбработки", ПараметрыОбработки.ИмяВременнойТаблицы);
	Запрос.УстановитьПараметр("ХозяйственнаяОперацияПередачаНаХранение", Перечисления.ХозяйственныеОперации.ПередачаНаХранениеСПравомПродажи);
	Запрос.УстановитьПараметр("ТипРасчетыСКлиентом", Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом);
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ПоляКлючаАналитики =  РезультатыЗапроса[0].Выгрузить();
	ПоляПоискаКорАналитики = "Регистратор,КорОбъектРасчетов,КорАналитикаУчетаПоПартнерам";
	ПоляПоискаАналитики = "Регистратор,ОбъектРасчетов,Организация,Контрагент,Договор,НаправлениеДеятельности";
	ПоляКлючаАналитики.Индексы.Добавить(ПоляПоискаКорАналитики);
	ПоляКлючаАналитики.Индексы.Добавить(ПоляПоискаАналитики);
	
	ОбновляемыеДанные =  РезультатыЗапроса[1].Выбрать();
	ЗаказыНаОтветХранение = РезультатыЗапроса[2].Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	ЗапросВспомогательныхДанных = ЗапросВспомогательныхДанных(Истина);
	
	ПоляЗаполнения = "
		|Активность,Период,АналитикаУчетаПоПартнерам,Валюта,КОплате,
		|ХозяйственнаяОперация,ФормаОплаты,СчетНаОплату,
		|ПорядокОперации,ВалютаДокумента,ИдентификаторФинЗаписи";
	
	Пока ОбновляемыеДанные.Следующий() Цикл
		
		ПроблемныйРегистратор = ОбновляемыеДанные.Регистратор;
		
		ЗапросВспомогательныхДанных.УстановитьПараметр("Ссылка", ПроблемныйРегистратор);
		ВспомогательныеДанные = ЗапросВспомогательныхДанных.ВыполнитьПакет();
		РегистраторыРасчетов = ВспомогательныеДанные[0].Выгрузить();
		
		НачатьТранзакцию();
		
		Попытка
			
			#Область Блокировки
			Блокировка = Новый БлокировкаДанных;
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РасчетыСКлиентами.НаборЗаписей");
			ЭлементБлокировки.УстановитьЗначение("Регистратор", ПроблемныйРегистратор);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РасчетыСКлиентамиПоСрокам.НаборЗаписей");
			ЭлементБлокировки.ИсточникДанных = РегистраторыРасчетов;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Регистратор", "Регистратор");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			
			Блокировка.Заблокировать();
			#КонецОбласти
			
			НаборЗаписей = СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ПроблемныйРегистратор);
			НаборЗаписей.Прочитать();

			Если ЗаказыНаОтветХранение.Найти(ПроблемныйРегистратор) <> Неопределено Тогда
				НаборЗаписей.Очистить();
			КонецЕсли;
			
			Если НакладныеПоГрафикам.Найти(ПроблемныйРегистратор) <> Неопределено Тогда
				
				ДатаРегистратора = Дата(1,1,1);
				ЕстьРасходКОплате = Ложь;
				ЗаписьСуммы = Неопределено;
				ЗаписьКОтгрузке = Неопределено;
				Для Каждого Запись Из НаборЗаписей Цикл
					Если Запись.Сумма > 0 
						И Запись.ВидДвижения = ВидДвиженияНакопления.Приход 
						И Запись.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПереносАванса
						И Запись.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПереносЗадолженностиМеждуФилиалами Тогда
						ЗаписьСуммы = Запись;
					КонецЕсли;
					Если НЕ ЗначениеЗаполнено(ДатаРегистратора) И ЗначениеЗаполнено(Запись.ДатаРегистратора) Тогда
						ДатаРегистратора = Запись.ДатаРегистратора;
					КонецЕсли;
					Если Запись.КОтгрузке <> 0 Тогда
						ЗаписьКОтгрузке = Запись;
					КонецЕсли;
					Если Запись.КОплате > 0 
						И Запись.ВидДвижения = ВидДвиженияНакопления.Расход 
						И Запись.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПереносАванса
						И Запись.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПереносЗадолженностиМеждуФилиалами Тогда
						ЕстьРасходКОплате = Истина;
					КонецЕсли;
				КонецЦикла;
				
				ЗаписьНакладной = ?(ЗаписьСуммы <> Неопределено, ЗаписьСуммы, ЗаписьКОтгрузке);
				
				Если Не ЕстьРасходКОплате И ЗаписьНакладной <> Неопределено Тогда
					
					Для Каждого Запись Из НаборЗаписей Цикл
						
						Если (Запись.Сумма > 0 
							//РТУ в статусе "В пути"
							ИЛИ Запись.КОтгрузке > 0 И ЗаписьСуммы = Неопределено)
							И Запись.ВидДвижения = ВидДвиженияНакопления.Приход 
							И Запись.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПереносАванса
							И Запись.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПереносЗадолженностиМеждуФилиалами Тогда
							КОплатеПриход = НаборЗаписей.Добавить();
							ЗаполнитьЗначенияСвойств(КОплатеПриход,ЗаписьНакладной,ПоляЗаполнения);
							КОплатеПриход.Период = КонецДня(Запись.ДатаПлатежа);
							КОплатеПриход.ВидДвижения = ВидДвиженияНакопления.Приход;
							КОплатеПриход.КОплате = ?(Запись.Сумма>0,Запись.Сумма,Запись.КОтгрузке);
							КОплатеПриход.ВариантОплаты = Запись.ВариантОплаты;
							КОплатеПриход.ДатаПлатежа = Запись.ДатаПлатежа;
							КОплатеПриход.ПродажаПоЗаказу = Запись.ПродажаПоЗаказу;
							КОплатеПриход.ИсключатьПриКонтроле = Запись.ИсключатьПриКонтроле;
							КОплатеПриход.ПорядокЗачетаПоДатеПлатежа = Запись.ПорядокЗачетаПоДатеПлатежа;
							КОплатеПриход.ОбъектРасчетов = Запись.ОбъектРасчетов;
							КОплатеПриход.ДатаРегистратора = ДатаРегистратора;
							Если НЕ ЗначениеЗаполнено(КОплатеПриход.ВариантОплаты) Тогда
								КОплатеПриход.ВариантОплаты = Перечисления.ВариантыКонтроляОплатыКлиентом.КредитПослеОтгрузки;
							КонецЕсли;
						КонецЕсли;
						Если Запись.КОтгрузке > 0
							И Запись.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
							КОплатеРасход = НаборЗаписей.Добавить();
							ЗаполнитьЗначенияСвойств(КОплатеРасход,ЗаписьНакладной,ПоляЗаполнения);
							КОплатеРасход.Период = Запись.Период;
							КОплатеРасход.ВидДвижения = ВидДвиженияНакопления.Расход;
							КОплатеРасход.КОплате = Запись.КОтгрузке;
							КОплатеРасход.ПродажаПоЗаказу = Запись.ПродажаПоЗаказу;
							КОплатеРасход.ИсключатьПриКонтроле = Ложь;
							КОплатеРасход.ПорядокЗачетаПоДатеПлатежа = ЗаписьНакладной.ПорядокОперации;
							КОплатеРасход.ОбъектРасчетов = Запись.ОбъектРасчетов;
							КОплатеРасход.ДатаРегистратора = ДатаРегистратора;
						КонецЕсли;
					КонецЦикла;
						
				КонецЕсли;
			КонецЕсли;
			
			#Область ИсключатьПриКонтроле
			Если ТипЗнч(ПроблемныйРегистратор) = Тип("ДокументСсылка.ПередачаТоваровМеждуОрганизациями") 
				ИЛИ ТипЗнч(ПроблемныйРегистратор) = Тип("ДокументСсылка.ОтчетПоКомиссииМеждуОрганизациями") 
				ИЛИ ТипЗнч(ПроблемныйРегистратор) = Тип("ДокументСсылка.ОтчетПоКомиссииМеждуОрганизациямиОСписании") 
				ИЛИ ТипЗнч(ПроблемныйРегистратор) = Тип("ДокументСсылка.РасходныйКассовыйОрдер") 
				ИЛИ ТипЗнч(ПроблемныйРегистратор) = Тип("ДокументСсылка.СписаниеБезналичныхДенежныхСредств") 
				ИЛИ ТипЗнч(ПроблемныйРегистратор) = Тип("ДокументСсылка.ОперацияПоПлатежнойКарте")
			Тогда
				Для Каждого Запись Из НаборЗаписей Цикл
					Если Запись.ВидДвижения = ВидДвиженияНакопления.Приход
						И Запись.КОплате > 0 ИЛИ Запись.Сумма > 0 Тогда
						Запись.ИсключатьПриКонтроле = Истина;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			#КонецОбласти
			
			#Область ИсправлениеКорАналитики
			ДанныеНабора = НаборЗаписей.Выгрузить();
			СтарыеДанныеНабора = НаборЗаписей.Выгрузить();
			ОтметитьОбработку = Истина;
			ЕстьИзменения = Ложь;
			
			ДанныеНабора.Индексы.Добавить("АналитикаУчетаПоПартнерам,ОбъектРасчетов,НастройкаХозяйственнойОперации");
			ТаблицыДвижений = Неопределено;
			НовыеДанныеНабора = Неопределено;
			Если ТипЗнч(ПроблемныйРегистратор) = Тип("ДокументСсылка.ВзаимозачетЗадолженности") Тогда
				Для Каждого Запись Из ДанныеНабора Цикл
					
					Если НЕ ЗначениеЗаполнено(Запись.КорОбъектРасчетов) Тогда
						Продолжить;
					КонецЕсли;
					
					Отбор = Новый Структура("АналитикаУчетаПоПартнерам,ОбъектРасчетов");
					Отбор.ОбъектРасчетов = Запись.КорОбъектРасчетов;
					Отбор.АналитикаУчетаПоПартнерам = Запись.КорАналитикаУчетаПоПартнерам;
					СтрокиИсточники = ДанныеНабора.НайтиСтроки(Отбор);
					Если СтрокиИсточники.Количество() <> 0 Тогда
						Продолжить;
					КонецЕсли;
					
					ОтборКорАналитики = Новый Структура(ПоляПоискаКорАналитики);
					ОтборКорАналитики.Регистратор = ПроблемныйРегистратор;
					ОтборКорАналитики.КорОбъектРасчетов = Запись.КорОбъектРасчетов;
					ОтборКорАналитики.КорАналитикаУчетаПоПартнерам = Запись.КорАналитикаУчетаПоПартнерам;
					КорАналитика = ПоляКлючаАналитики.НайтиСтроки(ОтборКорАналитики);
					
					Если КорАналитика.Количество() = 0 Тогда
						ОтметитьОбработку = Ложь;
						Прервать;
					КонецЕсли;
					
					ОтборАналитики = Новый Структура(ПоляПоискаАналитики);
					ОтборАналитики.Регистратор = ПроблемныйРегистратор;
					ОтборАналитики.ОбъектРасчетов = Запись.КорОбъектРасчетов;
					ОтборАналитики.Организация = КорАналитика[0].КорОрганизация;
					ОтборАналитики.Контрагент = КорАналитика[0].КорКонтрагент;
					ОтборАналитики.Договор = КорАналитика[0].КорДоговор;
					ОтборАналитики.НаправлениеДеятельности = КорАналитика[0].КорНаправлениеДеятельности;
				
					Аналитика = ПоляКлючаАналитики.НайтиСтроки(ОтборАналитики);
					Если Аналитика.Количество() = 1 Тогда
						Запись.КорАналитикаУчетаПоПартнерам = Аналитика[0].АналитикаУчетаПоПартнерам;
						ЕстьИзменения = Истина;
					Иначе
						Если ТаблицыДвижений = Неопределено Тогда
							ТаблицыДвижений = Документы.ВзаимозачетЗадолженности.ДанныеДокументаДляПроведения(ПроблемныйРегистратор, ИмяОбъекта);
						КонецЕсли;
						НовыеДанныеНабора = ТаблицыДвижений.ТаблицаРасчетыСКлиентами;
						Для Каждого Строка Из НовыеДанныеНабора Цикл
							НоваяСтрока = СтарыеДанныеНабора.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
							НоваяСтрока.Сумма = -Строка.Сумма;
							НоваяСтрока.КОплате = -Строка.КОплате;
							НоваяСтрока.СуммаРегл = -Строка.СуммаРегл;
							НоваяСтрока.СуммаУпр = -Строка.СуммаУпр;
						КонецЦикла;
						КопияНабора = НовыеДанныеНабора.Скопировать();
						КопияНабора.Свернуть("АналитикаУчетаПоПартнерам,ОбъектРасчетов,Валюта","Сумма,КОплате,СуммаРегл,СуммаУпр");
						СтарыеДанныеНабора.Свернуть("АналитикаУчетаПоПартнерам,ОбъектРасчетов,Валюта","Сумма,КОплате,СуммаРегл,СуммаУпр");
						ОтборНулей = Новый Структура("Сумма,КОплате,СуммаРегл,СуммаУпр",0,0,0,0);
						СтрокиСНулями = СтарыеДанныеНабора.НайтиСтроки(ОтборНулей);
						Если СтрокиСНулями.Количество() <> КопияНабора.Количество() Тогда
							НовыеДанныеНабора = Неопределено;
							ОтметитьОбработку = Истина;
						КонецЕсли;
						Прервать;
					КонецЕсли;
					
				КонецЦикла;
			КонецЕсли;
			Если НовыеДанныеНабора <> Неопределено Тогда
				НаборЗаписей.Загрузить(НовыеДанныеНабора);
			ИначеЕсли ЕстьИзменения Тогда
				НаборЗаписей.Загрузить(ДанныеНабора);
			КонецЕсли;
			#КонецОбласти
			
			#Область ЗаполнениеПриемниковВОперативномРегистре
			ПриемникиДокумента = ВспомогательныеДанные[2].Выгрузить();
			ИсточникиДокумента = ВспомогательныеДанные[3].Выгрузить();
			
			МассивОтборов = Новый Массив;
			МассивОтборов.Добавить(Новый Структура("Регистратор,АналитикаУчетаПоПартнерам,ОбъектРасчетов,ХозяйственнаяОперация,Сторно"));
			МассивОтборов.Добавить(Новый Структура("Регистратор,ОбъектРасчетов,ХозяйственнаяОперация,Сторно"));
			МассивОтборов.Добавить(Новый Структура("Регистратор,ХозяйственнаяОперация,Сторно"));
			ЕстьОшибка = Ложь;
			Для Каждого Приемник Из ПриемникиДокумента Цикл
				Если Приемник.ВалютаНеСовпадает Тогда
					Отбор = МассивОтборов[0];
					ЗаполнитьЗначенияСвойств(Отбор,Приемник);
					Отбор.АналитикаУчетаПоПартнерам = Приемник.КорАналитикаУчетаПоПартнерам;
					Отбор.ОбъектРасчетов = Приемник.КорОбъектРасчетов;
					РаспределитьПриемникПоИсточникам(НаборЗаписей, Приемник, Отбор, ЕстьОшибка);
				Иначе
					Для Каждого Отбор Из МассивОтборов Цикл
						
						ЗаполнитьЗначенияСвойств(Отбор,Приемник);
						Если Отбор.Свойство("АналитикаУчетаПоПартнерам") Тогда
							Отбор.АналитикаУчетаПоПартнерам = Приемник.КорАналитикаУчетаПоПартнерам;
						КонецЕслИ;
						Если Отбор.Свойство("ОбъектРасчетов") Тогда
							Отбор.ОбъектРасчетов = Приемник.КорОбъектРасчетов;
						КонецЕсли;
						Источники = ИсточникиДокумента.Скопировать(Отбор);
						СуммаИсточников = Источники.Итог("Сумма");
						Если Макс(Приемник.Сумма,-Приемник.Сумма) > Макс(СуммаИсточников,-СуммаИсточников) Тогда
							ЕстьОшибка = Истина;
							Прервать;
						ИначеЕсли Макс(Приемник.Сумма,-Приемник.Сумма) < Макс(СуммаИсточников,-СуммаИсточников) Тогда
							Продолжить;
						Иначе
							РаспределитьПриемникПоИсточникам(НаборЗаписей, Приемник, Отбор, ЕстьОшибка);
							Прервать;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
			#КонецОбласти
			
			Если НаборЗаписей.Модифицированность() И НЕ ЕстьОшибка Тогда
			#Область РаспределениеРасчетовПоСрокам
				
				МассивОтборов = Новый Массив;
				МассивОтборов.Добавить(Новый Структура("ДокументРегистратор,АналитикаУчетаПоПартнерам,ОбъектРасчетов,ХозяйственнаяОперация,Сторно"));
				МассивОтборов.Добавить(Новый Структура("ДокументРегистратор,ОбъектРасчетов,ХозяйственнаяОперация,Сторно"));
				МассивОтборов.Добавить(Новый Структура("ДокументРегистратор,ХозяйственнаяОперация,Сторно"));
				
				НаборыРегистраторовРасчетов = НаборыРегистраторовРасчетов(РегистраторыРасчетов);
				ПриемникиДокументаПоСрокам = ВспомогательныеДанные[5].Выгрузить();
				ИсточникиДокументаПоСрокам = ВспомогательныеДанные[6].Выгрузить();
				Для Каждого Приемник Из ПриемникиДокументаПоСрокам Цикл
					Если Приемник.ВалютаНеСовпадает Тогда
						Отбор = МассивОтборов[0];
						ЗаполнитьЗначенияСвойств(Отбор,Приемник);
						Отбор.АналитикаУчетаПоПартнерам = Приемник.КорАналитикаУчетаПоПартнерам;
						Отбор.ОбъектРасчетов = Приемник.КорОбъектРасчетов;
						РаспределитьПриемникПоИсточникамПоСрокам(НаборыРегистраторовРасчетов, Приемник, Отбор, ЕстьОшибка);
					Иначе
						Для Каждого Отбор Из МассивОтборов Цикл
							ЗаполнитьЗначенияСвойств(Отбор,Приемник);
							Если Отбор.Свойство("АналитикаУчетаПоПартнерам") Тогда
								Отбор.АналитикаУчетаПоПартнерам = Приемник.КорАналитикаУчетаПоПартнерам;
							КонецЕслИ;
							Если Отбор.Свойство("ОбъектРасчетов") Тогда
								Отбор.ОбъектРасчетов = Приемник.КорОбъектРасчетов;
							КонецЕсли;
							Источники = ИсточникиДокументаПоСрокам.Скопировать(Отбор);
							СуммаИсточников = Источники.Итог("Сумма");
							Если Макс(Приемник.Сумма,-Приемник.Сумма) > Макс(СуммаИсточников,-СуммаИсточников) Тогда
								ЕстьОшибка = Истина;
								Прервать;
							ИначеЕсли Макс(Приемник.Сумма,-Приемник.Сумма) < Макс(СуммаИсточников,-СуммаИсточников) Тогда
								Продолжить;
							Иначе
								РаспределитьПриемникПоИсточникамПоСрокам(НаборыРегистраторовРасчетов, Приемник, Отбор, ЕстьОшибка);
								Прервать;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
				КонецЦикла;
				
			#КонецОбласти
				Если НЕ ЕстьОшибка Тогда
					Для Каждого КлючИЗначение Из НаборыРегистраторовРасчетов Цикл
						Набор = РегистрыНакопления.РасчетыСКлиентамиПоСрокам.СоздатьНаборЗаписей();
						Набор.Отбор.Регистратор.Установить(КлючИЗначение.Ключ);
						Набор.Загрузить(КлючИЗначение.Значение);
						Набор.ОбменДанными.Загрузка = Истина;
						Набор.Записать();
					КонецЦикла;
				КонецЕсли;
				
			КонецЕсли;//был измен набор оперативного регистра
			
			ЕстьЗаявкиНаРасходованиеДенежныхСредств = Ложь;
			Для Каждого Запись Из НаборЗаписей Цикл
				Если Запись.ВидДвижения = ВидДвиженияНакопления.Приход
					И Запись.КОплате > 0 
					И НачалоДня(Запись.Период) < НачалоДня(Запись.ДатаРегистратора) 
					И НЕ ТипЗнч(ПроблемныйРегистратор) = Тип("ДокументСсылка.ВводОстатков")
					И НЕ ТипЗнч(ПроблемныйРегистратор) = Тип("ДокументСсылка.ВводОстатковВзаиморасчетов") Тогда
					Запись.Период = Запись.ДатаРегистратора;
				КонецЕсли;
				Если ЗначениеЗаполнено(Запись.ЗаявкаНаРасходованиеДенежныхСредств) Тогда
					ЕстьЗаявкиНаРасходованиеДенежныхСредств = Истина;
				КонецЕсли;
			КонецЦикла;
			
			//Очистка ресурса "Оплачивается"
			Если ЕстьЗаявкиНаРасходованиеДенежныхСредств Тогда
				ЗаявкиНаРасходованиеДенежныхСредств = НаборЗаписей.ВыгрузитьКолонку("ЗаявкаНаРасходованиеДенежныхСредств");
				РеквизитыЗаявок = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(ЗаявкиНаРасходованиеДенежныхСредств,"КонтролироватьОплатуПоОбъектамРасчетов");
				Для Каждого Запись Из НаборЗаписей Цикл
					Если ЗначениеЗаполнено(Запись.ЗаявкаНаРасходованиеДенежныхСредств)
						И Запись.Оплачивается <> 0 
						И НЕ РеквизитыЗаявок[Запись.ЗаявкаНаРасходованиеДенежныхСредств] Тогда
						Запись.Оплачивается = 0;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			//Перезаполнение поля ПорядокЗачетаПоДатеПлатежа
			ТипДокумента = ТипЗнч(Запись.Регистратор);
			Тип = ОперативныеВзаиморасчетыСервер.НомерТипа(ТипДокумента);
			Для Каждого Запись Из НаборЗаписей Цикл
				Если Запись.ВидДвижения = ВидДвиженияНакопления.Расход
					И Запись.Сумма > 0 
					И ЗначениеЗаполнено(Запись.ДатаПлатежа)
					И НачалоДня(Запись.ДатаПлатежа) <> НачалоДня(Запись.ДатаРегистратора) 
					И Запись.ПорядокОперации = Запись.ПорядокЗачетаПоДатеПлатежа 
					И Запись.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПереносЗадолженностиМеждуФилиалами Тогда
					Запись.ПорядокЗачетаПоДатеПлатежа = ОперативныеВзаиморасчетыСервер.Порядок(Запись.ДатаПлатежа, 
						ОбновляемыеДанные.РегистраторНомер, ТипДокумента, Сред(Запись.ПорядокОперации,9,1), Тип);
				КонецЕсли;
			КонецЦикла;
			#Область ИсправлениеПорядкаОперации
			Если ТипЗнч(ПроблемныйРегистратор) = Тип("ДокументСсылка.ЗаказКлиента")
				
				ИЛИ ТипЗнч(ПроблемныйРегистратор) = Тип("ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента") Тогда
				НомерДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПроблемныйРегистратор, "Номер");
				Для Каждого Запись Из НаборЗаписей Цикл
					Если Запись.КОтгрузке <> 0 Тогда
						Запись.ПорядокОперации = ОперативныеВзаиморасчетыСервер.Порядок(
							Запись.ДатаРегистратора,
							НомерДокумента,
							ТипЗнч(Запись.Регистратор),
							1);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			#КонецОбласти
			
			Если НаборЗаписей.Модифицированность() Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);
			ИначеЕсли ОтметитьОбработку Тогда
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(НаборЗаписей);
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			ОбновлениеИнформационнойБазыУТ.СообщитьОНеудачнойОбработке(ИнформацияОбОшибке(), ПроблемныйРегистратор);
			
		КонецПопытки;
		
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяОбъекта);
	
КонецПроцедуры

#Область ЗаполнениеИденитификаторовИПриемников

// Запрос вспомогательных данных.
// 
// Параметры:
//  ЭтоРасчетыСКлиентами - Булево - Это расчеты с клиентами
// 
// Возвращаемое значение:
//  Запрос - Запрос вспомогательных данных
Функция ЗапросВспомогательныхДанных(ЭтоРасчетыСКлиентами) Экспорт
	
	ТекстыЗапросов = Новый Массив;
	ТекстыЗапросов.Добавить(ТекстЗапросаРегистраторовЗапроса(ЭтоРасчетыСКлиентами));
	ТекстыЗапросов.Добавить(ТекстЗапросаПриемниковИсточников(ЭтоРасчетыСКлиентами));
	ТекстыЗапросов.Добавить(ТекстЗапросаПриемниковИсточниковПоСрокам(ЭтоРасчетыСКлиентами));
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЭтоРасчетыСКлиентами", ЭтоРасчетыСКлиентами);
	Запрос.Текст = СтрСоединить(ТекстыЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
	
	Возврат Запрос;
	
КонецФункции

Функция ТекстЗапросаРегистраторовЗапроса(ЭтоРасчетыСКлиентами)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасчетыПоСрокам.ДокументРегистратор КАК ДокументРегистратор,
	|	РасчетыПоСрокам.Регистратор КАК Регистратор,
	|	&ЭтоРасчетыСКлиентами КАК ЭтоРасчетыСКлиентами
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыПоСрокам
	|ГДЕ
	|	РасчетыПоСрокам.ДокументРегистратор = &Ссылка
	|";
	
	Если НЕ ЭтоРасчетыСКлиентами Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
							"РегистрНакопления.РасчетыСКлиентамиПоСрокам",
							"РегистрНакопления.РасчетыСПоставщикамиПоСрокам");
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаПриемниковИсточников(ЭтоРасчетыСКлиентами)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Приемники.Регистратор КАК Регистратор,
	|	СУММА(ВЫБОР КОГДА Приемники.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ТОГДА Приемники.Сумма
	|		ИНАЧЕ -Приемники.Сумма
	|	КОНЕЦ) КАК Сумма,
	|	СУММА(ВЫБОР КОГДА Приемники.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ТОГДА Приемники.Сумма
	|		ИНАЧЕ -Приемники.Сумма
	|	КОНЕЦ) > 0 КАК ПоложительнаяСумма,
	|	Приемники.ОбъектРасчетов КАК ОбъектРасчетов,
	|	Приемники.Валюта КАК Валюта,
	|	Приемники.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Приемники.КорОбъектРасчетов КАК КорОбъектРасчетов,
	|	Приемники.КорОбъектРасчетов.ВалютаВзаиморасчетов КАК КорВалютаВзаиморасчетов,
	|	Приемники.КорАналитикаУчетаПоПартнерам КАК КорАналитикаУчетаПоПартнерам,
	|	Приемники.Валюта <> Приемники.КорОбъектРасчетов.Валюта
	|		И ТИПЗНАЧЕНИЯ(Приемники.Регистратор) = ТИП(Документ.ВзаимозачетЗадолженности)
	|		И ВЫРАЗИТЬ(Приемники.Регистратор КАК Документ.ВзаимозачетЗадолженности).ВидОперации В(
	|			ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачетаЗадолженности.ОтражениеОплатыЧерезКомиссионера),
	|			ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачетаЗадолженности.ОтражениеВозвратаОплатыЧерезКомиссионера)) КАК ВалютаНеСовпадает,
	|	Приемники.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	Приемники.Сторно КАК Сторно
	|ПОМЕСТИТЬ втПриемники
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами КАК Приемники
	|ГДЕ
	|	Приемники.Регистратор = &Ссылка
	|	И Приемники.КорОбъектРасчетов <> ЗНАЧЕНИЕ(Справочник.ОбъектыРасчетов.ПустаяСсылка)
	|	И Приемники.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗачетАвансаКлиента)
	|	И Приемники.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗачетАвансаПоставщику)
	|СГРУППИРОВАТЬ ПО
	|	Приемники.Регистратор,
	|	Приемники.ОбъектРасчетов,
	|	Приемники.АналитикаУчетаПоПартнерам,
	|	Приемники.Валюта,
	|	Приемники.КорОбъектРасчетов,
	|	Приемники.КорАналитикаУчетаПоПартнерам,
	|	Приемники.ХозяйственнаяОперация,
	|	Приемники.Сторно
	|;
	|
	|ВЫБРАТЬ
	|	Приемники.Регистратор КАК Регистратор,
	|	Приемники.Сумма КАК Сумма,
	|	Приемники.ПоложительнаяСумма КАК ПоложительнаяСумма,
	|	Приемники.Валюта КАК Валюта,
	|	Приемники.ОбъектРасчетов КАК ОбъектРасчетов,
	|	Приемники.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Приемники.КорВалютаВзаиморасчетов КАК КорВалютаВзаиморасчетов,
	|	Приемники.КорОбъектРасчетов КАК КорОбъектРасчетов,
	|	Приемники.КорАналитикаУчетаПоПартнерам КАК КорАналитикаУчетаПоПартнерам,
	|	Приемники.ВалютаНеСовпадает КАК ВалютаНеСовпадает,
	|	Приемники.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	Приемники.Сторно КАК Сторно
	|ИЗ
	|	втПриемники КАК Приемники
	|;
	|
	|ВЫБРАТЬ
	|	Источники.Регистратор КАК Регистратор,
	|	СУММА(ВЫБОР КОГДА Источники.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ТОГДА -Источники.Сумма
	|		ИНАЧЕ Источники.Сумма
	|	КОНЕЦ) КАК Сумма,
	|	СУММА(ВЫБОР КОГДА Источники.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ТОГДА Источники.Сумма
	|		ИНАЧЕ -Источники.Сумма
	|	КОНЕЦ) > 0 КАК ПоложительнаяСумма,
	|	Источники.ОбъектРасчетов КАК ОбъектРасчетов,
	|	Источники.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Источники.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	Источники.Сторно КАК Сторно,
	|	ИСТИНА КАК ЭтоРасчетыСКлиентами
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами КАК Источники
	|ГДЕ
	|	(Регистратор, ОбъектРасчетов, АналитикаУчетаПоПартнерам, ХозяйственнаяОперация, Сторно) В 
	|		(ВЫБРАТЬ
	|			Регистратор, КорОбъектРасчетов, КорАналитикаУчетаПоПартнерам, ХозяйственнаяОперация, Сторно
	|		ИЗ
	|			втПриемники)
	|СГРУППИРОВАТЬ ПО
	|	Источники.Регистратор,
	|	Источники.ОбъектРасчетов,
	|	Источники.АналитикаУчетаПоПартнерам,
	|	Источники.ХозяйственнаяОперация,
	|	Источники.Сторно";
	
	Если НЕ ЭтоРасчетыСКлиентами Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
							"РегистрНакопления.РасчетыСКлиентами",
							"РегистрНакопления.РасчетыСПоставщиками");
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаПриемниковИсточниковПоСрокам(ЭтоРасчетыСКлиентами)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Приемники.ДокументРегистратор КАК ДокументРегистратор,
	|	Приемники.Регистратор КАК Регистратор,
	|	СУММА(ВЫБОР КОГДА Приемники.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ТОГДА Приемники.Долг - Приемники.Предоплата
	|		ИНАЧЕ Приемники.Предоплата - Приемники.Долг
	|	КОНЕЦ) КАК Сумма,
	|	СУММА(ВЫБОР КОГДА Приемники.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ТОГДА Приемники.Долг - Приемники.Предоплата
	|		ИНАЧЕ Приемники.Предоплата - Приемники.Долг
	|	КОНЕЦ) > 0 КАК ПоложительнаяСумма,
	|	Приемники.ОбъектРасчетов КАК ОбъектРасчетов,
	|	Приемники.Валюта КАК Валюта,
	|	Приемники.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Приемники.КорОбъектРасчетов КАК КорОбъектРасчетов,
	|	Приемники.КорОбъектРасчетов.ВалютаВзаиморасчетов КАК КорВалютаВзаиморасчетов,
	|	Приемники.КорАналитикаУчетаПоПартнерам КАК КорАналитикаУчетаПоПартнерам,
	|	Приемники.Валюта <> Приемники.КорОбъектРасчетов.ВалютаВзаиморасчетов
	|		И ТИПЗНАЧЕНИЯ(Приемники.ДокументРегистратор) = ТИП(Документ.ВзаимозачетЗадолженности)
	|		И ВЫРАЗИТЬ(Приемники.ДокументРегистратор КАК Документ.ВзаимозачетЗадолженности).ВидОперации В(
	|			ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачетаЗадолженности.ОтражениеОплатыЧерезКомиссионера),
	|			ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаимозачетаЗадолженности.ОтражениеВозвратаОплатыЧерезКомиссионера)) КАК ВалютаНеСовпадает,
	|	Приемники.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	Приемники.Сторно КАК Сторно
	|ПОМЕСТИТЬ втПриемникиПоСрокам
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК Приемники
	|ГДЕ
	|	Приемники.ДокументРегистратор = &Ссылка
	|	И Приемники.КорОбъектРасчетов <> ЗНАЧЕНИЕ(Справочник.ОбъектыРасчетов.ПустаяСсылка)
	|	И Приемники.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Справочник.ОбъектыРасчетов.ПустаяСсылка)
	|	И Приемники.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗачетАвансаКлиента)
	|	И Приемники.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗачетАвансаПоставщику)
	|СГРУППИРОВАТЬ ПО
	|	Приемники.ДокументРегистратор,
	|	Приемники.Регистратор,
	|	Приемники.ОбъектРасчетов,
	|	Приемники.Валюта,
	|	Приемники.АналитикаУчетаПоПартнерам,
	|	Приемники.КорОбъектРасчетов,
	|	Приемники.КорАналитикаУчетаПоПартнерам,
	|	Приемники.ХозяйственнаяОперация,
	|	Приемники.Сторно
	|;
	|
	|ВЫБРАТЬ
	|	Приемники.ДокументРегистратор КАК ДокументРегистратор,
	|	Приемники.Регистратор КАК Регистратор,
	|	Приемники.Сумма КАК Сумма,
	|	Приемники.ПоложительнаяСумма КАК ПоложительнаяСумма,
	|	Приемники.Валюта КАК Валюта,
	|	Приемники.ОбъектРасчетов КАК ОбъектРасчетов,
	|	Приемники.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Приемники.КорВалютаВзаиморасчетов КАК КорВалюта,
	|	Приемники.КорОбъектРасчетов КАК КорОбъектРасчетов,
	|	Приемники.КорАналитикаУчетаПоПартнерам КАК КорАналитикаУчетаПоПартнерам,
	|	Приемники.ВалютаНеСовпадает КАК ВалютаНеСовпадает,
	|	Приемники.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	Приемники.Сторно КАК Сторно
	|ИЗ
	|	втПриемникиПоСрокам КАК Приемники
	|;
	|
	|ВЫБРАТЬ
	|	Источники.ДокументРегистратор КАК ДокументРегистратор,
	|	Источники.Регистратор КАК Регистратор,
	|	СУММА(ВЫБОР КОГДА Источники.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ТОГДА Источники.Предоплата - Источники.Долг
	|		ИНАЧЕ Источники.Долг - Источники.Предоплата
	|	КОНЕЦ) КАК Сумма,
	|	СУММА(ВЫБОР КОГДА Источники.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ТОГДА Источники.Долг - Источники.Предоплата
	|		ИНАЧЕ Источники.Предоплата - Источники.Долг
	|	КОНЕЦ) > 0 КАК ПоложительнаяСумма,
	|	Источники.ОбъектРасчетов КАК ОбъектРасчетов,
	|	Источники.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Источники.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	Источники.Сторно КАК Сторно,
	|	ИСТИНА КАК ЭтоРасчетыСКлиентами
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК Источники
	|ГДЕ
	|	(ДокументРегистратор, ОбъектРасчетов, АналитикаУчетаПоПартнерам, ХозяйственнаяОперация, Сторно) В 
	|		(ВЫБРАТЬ
	|			ДокументРегистратор, КорОбъектРасчетов, КорАналитикаУчетаПоПартнерам, ХозяйственнаяОперация, Сторно
	|		ИЗ
	|			втПриемникиПоСрокам)
	|СГРУППИРОВАТЬ ПО
	|	Источники.ДокументРегистратор,
	|	Источники.Регистратор,
	|	Источники.ОбъектРасчетов,
	|	Источники.АналитикаУчетаПоПартнерам,
	|	Источники.ХозяйственнаяОперация,
	|	Источники.Сторно";
	
	Если НЕ ЭтоРасчетыСКлиентами Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
							"РегистрНакопления.РасчетыСКлиентамиПоСрокам",
							"РегистрНакопления.РасчетыСПоставщикамиПоСрокам");
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Наборы регистраторов расчетов.
// 
// Параметры:
//  РегистраторыРасчетов - ТаблицаЗначений - Регистраторы расчетов
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение - Наборы регистраторов расчетов:
//  * Ключ - ДокументСсылка - Регистратор набора.
//  * Значение - РегистрНакопленияНаборЗаписей.РасчетыСКлиентами,РегистрНакопленияНаборЗаписей.РасчетыСПоставщикамиПоСрокам 
//
Функция НаборыРегистраторовРасчетов(РегистраторыРасчетов) Экспорт
	
	Результат = Новый Соответствие;
	Для Каждого Запись Из РегистраторыРасчетов Цикл
		
		Если Запись.ЭтоРасчетыСКлиентами Тогда
			Набор = РегистрыНакопления.РасчетыСКлиентамиПоСрокам.СоздатьНаборЗаписей();
		Иначе
			Набор = РегистрыНакопления.РасчетыСПоставщикамиПоСрокам.СоздатьНаборЗаписей();
		КонецЕсли;
		Набор.Отбор.Регистратор.Установить(Запись.Регистратор);
		Набор.Прочитать();
		ТаблицаНабора = Набор.Выгрузить();
		ТаблицаНабора.Колонки.Добавить("ПоДаннымОбъектаРасчетовИсточника", Новый ОписаниеТипов("Булево"));
		ТаблицаНабора.Индексы.Добавить(ПоляПоиска());
		Результат.Вставить(Запись.Регистратор, ТаблицаНабора);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПоляПоиска()
	
	Возврат "ДокументРегистратор,АналитикаУчетаПоПартнерам,ОбъектРасчетов,"
			+ "КорАналитикаУчетаПоПартнерам,КорОбъектРасчетов,"
			+ "ХозяйственнаяОперация,Сторно,ПоДаннымОбъектаРасчетовИсточника";
	
КонецФункции

// Распределить приемник по источникам.
// 
// Параметры:
//  НаборЗаписей - РегистрНакопленияНаборЗаписей.РасчетыСКлиентами - Набор записей
//  КортежПриемник - СтрокаТаблицыЗначений - Кортеж приемник
//  ОтборИсточников - Произвольный, Структура - Отбор источников:
// * АналитикаУчетаПоПартнерам - СправочникСсылка.КлючиАналитикиУчетаПоПартнерам
// * ОбъектРасчетов  - СправочникСсылка.ОбъектыРасчетов
//  ЕстьОшибка - Взводится, если не удалось выполнить распределение
//
Процедура РаспределитьПриемникПоИсточникам(НаборЗаписей, КортежПриемник, ОтборИсточников, ЕстьОшибка) Экспорт
	
	НаборЗаписейТЗ= НаборЗаписей.Выгрузить();
	
	ИдентификаторФинЗаписи = Новый УникальныйИдентификатор;
	СуммаКРаспределению = Макс(КортежПриемник.Сумма,-КортежПриемник.Сумма);
	СуммаОтмечено = 0;
	Для Каждого Запись Из НаборЗаписейТЗ Цикл
		Если ЭтоЗаписьПриемник(Запись, КортежПриемник, ОтборИсточников) Тогда
			Запись.ПоДаннымОбъектаРасчетовИсточника = Истина;
			Запись.ИдентификаторФинЗаписи = ИдентификаторФинЗаписи;
			СуммаОтмечено = СуммаОтмечено + ?(Запись.Сумма < 0,-Запись.Сумма,Запись.Сумма);
		ИначеЕсли ЭтоЗаписьИсточник(Запись, ОтборИсточников, КортежПриемник) Тогда
			
			СуммаИсточника = ?(Запись.Сумма > 0,Запись.Сумма,-Запись.Сумма);
			СуммаПриемник = Мин(СуммаИсточника, СуммаКРаспределению);
			Запись.СуммаПриемник = СуммаПриемник;
			СуммаКРаспределению = СуммаКРаспределению - СуммаПриемник;
		
			Запись.АналитикаУчетаПоПартнерамПриемник = КортежПриемник.АналитикаУчетаПоПартнерам;
			Запись.ОбъектРасчетовПриемник = КортежПриемник.ОбъектРасчетов;
			Запись.ВалютаПриемник = КортежПриемник.Валюта;
			Запись.ИдентификаторФинЗаписи = ИдентификаторФинЗаписи;
			
		КонецЕсли;
		
	КонецЦикла;
	Если СуммаКРаспределению <> 0 
		ИЛИ СуммаОтмечено <> Макс(КортежПриемник.Сумма,-КортежПриемник.Сумма) Тогда
		ЕстьОшибка = Истина;
	Иначе
		НаборЗаписей.Загрузить(НаборЗаписейТЗ);
	КонецЕсли;
	
КонецПроцедуры

Функция ЭтоЗаписьПриемник(Запись, КортежПриемник, ОтборИсточников)
	
	АналитикаУчетаПоПартнерамИсточника = Неопределено;
	ОтборИсточников.Свойство("АналитикаУчетаПоПартнерам", АналитикаУчетаПоПартнерамИсточника);
	ОбъектРасчетовИсточника = Неопределено;
	ОтборИсточников.Свойство("ОбъектРасчетов", ОбъектРасчетовИсточника);
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Запись, "Сумма") Тогда
		ПоложительнаяСумма = Запись.ВидДвижения = ВидДвиженияНакопления.Приход И Запись.Сумма > 0
			ИЛИ Запись.ВидДвижения = ВидДвиженияНакопления.Расход И Запись.Сумма < 0;
	Иначе
		ПоложительнаяСумма = ?(Запись.ВидДвижения = ВидДвиженияНакопления.Приход, Запись.Долг - Запись.Предоплата,
			Запись.Предоплата - Запись.Долг) > 0;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Запись, "ДокументРегистратор") Тогда
		ПодходитПоРегистратору = Запись.ДокументРегистратор = ОтборИсточников.ДокументРегистратор;
	Иначе
		ПодходитПоРегистратору = Запись.Регистратор = ОтборИсточников.Регистратор;
	КонецЕсли;
	
	Возврат НЕ Запись.ПоДаннымОбъектаРасчетовИсточника
			И ПодходитПоРегистратору
			И Запись.ХозяйственнаяОперация = КортежПриемник.ХозяйственнаяОперация
			И Запись.Сторно = КортежПриемник.Сторно
			И Запись.АналитикаУчетаПоПартнерам = КортежПриемник.АналитикаУчетаПоПартнерам 
			И Запись.ОбъектРасчетов = КортежПриемник.ОбъектРасчетов
			И (Запись.КорАналитикаУчетаПоПартнерам = АналитикаУчетаПоПартнерамИсточника ИЛИ АналитикаУчетаПоПартнерамИсточника = Неопределено)
			И (Запись.КорОбъектРасчетов = ОбъектРасчетовИсточника ИЛИ ОбъектРасчетовИсточника = Неопределено)
			И ПоложительнаяСумма = КортежПриемник.ПоложительнаяСумма;
	
КонецФункции

Функция ЭтоЗаписьИсточник(Запись, ОтборИсточников, КортежПриемник)
	
	АналитикаУчетаПоПартнерам = Неопределено;
	ОтборИсточников.Свойство("АналитикаУчетаПоПартнерам", АналитикаУчетаПоПартнерам);
	ОбъектРасчетов = Неопределено;
	ОтборИсточников.Свойство("ОбъектРасчетов", ОбъектРасчетов);
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Запись, "Сумма") Тогда
		ПодходитПоЗнаку = (Запись.ВидДвижения = ВидДвиженияНакопления.Приход И Запись.Сумма > 0 И НЕ КортежПриемник.ПоложительнаяСумма
				ИЛИ Запись.ВидДвижения = ВидДвиженияНакопления.Расход И Запись.Сумма < 0 И НЕ КортежПриемник.ПоложительнаяСумма
				ИЛИ Запись.ВидДвижения = ВидДвиженияНакопления.Расход И Запись.Сумма > 0 И КортежПриемник.ПоложительнаяСумма
				ИЛИ Запись.ВидДвижения = ВидДвиженияНакопления.Приход И Запись.Сумма < 0 И КортежПриемник.ПоложительнаяСумма);
	Иначе
		ПодходитПоЗнаку = (Запись.ВидДвижения = ВидДвиженияНакопления.Приход И Запись.Долг > 0 И НЕ КортежПриемник.ПоложительнаяСумма
				ИЛИ Запись.ВидДвижения = ВидДвиженияНакопления.Расход И Запись.Предоплата > 0 И НЕ КортежПриемник.ПоложительнаяСумма
				ИЛИ Запись.ВидДвижения = ВидДвиженияНакопления.Расход И Запись.Долг > 0 И КортежПриемник.ПоложительнаяСумма
				ИЛИ Запись.ВидДвижения = ВидДвиженияНакопления.Приход И Запись.Предоплата > 0 И КортежПриемник.ПоложительнаяСумма);
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Запись, "ДокументРегистратор") Тогда
		ПодходитПоРегистратору = Запись.ДокументРегистратор = ОтборИсточников.ДокументРегистратор;
	Иначе
		ПодходитПоРегистратору = Запись.Регистратор = ОтборИсточников.Регистратор;
	КонецЕсли;
	
	Возврат НЕ ЗначениеЗаполнено(Запись.ОбъектРасчетовПриемник)
			И Запись.ХозяйственнаяОперация = ОтборИсточников.ХозяйственнаяОперация
			И ПодходитПоРегистратору
			И Запись.Сторно = ОтборИсточников.Сторно
			И (Запись.АналитикаУчетаПоПартнерам = АналитикаУчетаПоПартнерам ИЛИ АналитикаУчетаПоПартнерам = Неопределено)
			И (Запись.ОбъектРасчетов = ОбъектРасчетов ИЛИ ОбъектРасчетов = Неопределено)
			И ПодходитПоЗнаку;
	
КонецФункции

// Распределить приемник по источникам по срокам.
// 
// Параметры:
//  НаборыРегистраторовРасчетов - Соответствие Из КлючИЗначение- Наборы регистраторов расчетов:
//  * Ключ - ДокументСсылка - Регистратор набора.
//  * Значение - РегистрНакопленияНаборЗаписей.РасчетыСКлиентами,РегистрНакопленияНаборЗаписей.РасчетыСПоставщикамиПоСрокам
//  КортежПриемник - СтрокаТаблицыЗначений - Кортеж приемник
//  ОтборИсточников - Произвольный - Отбор источников:
// 	* АналитикаУчетаПоПартнерам - СправочникСсылка.КлючиАналитикиУчетаПоПартнерам
// 	* ОбъектРасчетов  - СправочникСсылка.ОбъектыРасчетов
// 	ЕстьОшибка - Взводится, если не удалось выполнить распределение
////  
Процедура РаспределитьПриемникПоИсточникамПоСрокам(НаборыРегистраторовРасчетов, КортежПриемник, ОтборИсточников, ЕстьОшибка) Экспорт
	
	ИдентификаторФинЗаписи = Новый УникальныйИдентификатор;
	СуммаКРаспределению = Макс(КортежПриемник.Сумма,-КортежПриемник.Сумма);
	Для Каждого Описание Из НаборыРегистраторовРасчетов Цикл
		
		Если СуммаКРаспределению = 0 Тогда
			Отбор = Новый Структура(ПоляПоиска());
			ЗаполнитьЗначенияСвойств(Отбор, КортежПриемник);
			Отбор.ПоДаннымОбъектаРасчетовИсточника = Ложь;
			НайденныеСтроки = Описание.Значение.НайтиСтроки(Отбор);
			Для Каждого Запись Из НайденныеСтроки Цикл
				Запись.ПоДаннымОбъектаРасчетовИсточника = Истина;
				Запись.ИдентификаторФинЗаписи = ИдентификаторФинЗаписи;
			КонецЦикла;
			
		Иначе
			сч = 0;
			Пока сч < Описание.Значение.Количество() Цикл
				
				Запись = Описание.Значение[сч];
				Если ЭтоЗаписьПриемник(Запись, КортежПриемник, ОтборИсточников) Тогда
					
					Запись.ПоДаннымОбъектаРасчетовИсточника = Истина;
					Запись.ИдентификаторФинЗаписи = ИдентификаторФинЗаписи;
				
				ИначеЕсли ЭтоЗаписьИсточник(Запись, ОтборИсточников, КортежПриемник) 
					И СуммаКРаспределению > 0 Тогда
					
					СуммаИсточника = Запись.Долг + Запись.Предоплата;
					СуммаПриемник = Мин(СуммаИсточника, СуммаКРаспределению);
					Если СуммаПриемник = СуммаИсточника Тогда
						Запись.СуммаПриемник = СуммаПриемник;
						Запись.АналитикаУчетаПоПартнерамПриемник = КортежПриемник.АналитикаУчетаПоПартнерам;
						Запись.ОбъектРасчетовПриемник = КортежПриемник.ОбъектРасчетов;
						Запись.ВалютаПриемник = КортежПриемник.Валюта;
						Запись.ИдентификаторФинЗаписи = ИдентификаторФинЗаписи;
					Иначе
						НоваяЗапись = Описание.Значение.Вставить(сч);
						ЗаполнитьЗначенияСвойств(НоваяЗапись,Запись);
						Если Запись.Долг > 0 Тогда
							СуммаРегл = Окр(Запись.ДолгРегл/Запись.Долг*СуммаПриемник,2);
							СуммаУпр = Окр(Запись.ДолгУпр/Запись.Долг*СуммаПриемник,2);
							Запись.ДолгРегл = Запись.ДолгРегл - СуммаРегл;
							Запись.ДолгУпр = Запись.ДолгУпр - СуммаУпр;
							Запись.Долг = Запись.Долг - СуммаПриемник;
							НоваяЗапись.ДолгРегл = СуммаРегл;
							НоваяЗапись.ДолгУпр = СуммаУпр;
							НоваяЗапись.Долг = СуммаПриемник;
						Иначе
							СуммаРегл = Окр(Запись.ПредоплатаРегл/Запись.Предоплата*СуммаПриемник,2);
							СуммаУпр = Окр(Запись.ПредоплатаУпр/Запись.Предоплата*СуммаПриемник,2);
							Запись.ПредоплатаРегл = Запись.ПредоплатаРегл - СуммаРегл;
							Запись.ПредоплатаУпр = Запись.ПредоплатаУпр - СуммаУпр;
							Запись.Предоплата = Запись.Предоплата - СуммаПриемник;
							НоваяЗапись.ПредоплатаРегл = СуммаРегл;
							НоваяЗапись.ПредоплатаУпр = СуммаУпр;
							НоваяЗапись.Предоплата = СуммаПриемник;
						КонецЕсли;
						НоваяЗапись.АналитикаУчетаПоПартнерамПриемник = КортежПриемник.АналитикаУчетаПоПартнерам;
						НоваяЗапись.ОбъектРасчетовПриемник = КортежПриемник.ОбъектРасчетов;
						НоваяЗапись.ВалютаПриемник = КортежПриемник.Валюта;
						
						НоваяЗапись.ИдентификаторФинЗаписи = ИдентификаторФинЗаписи;
						НоваяЗапись.СуммаПриемник = СуммаПриемник;
						
					КонецЕсли;
					СуммаКРаспределению = СуммаКРаспределению - СуммаПриемник;
					
				КонецЕсли;
				сч = сч + 1;
			КонецЦикла;//по записям набора
		КонецЕсли;// СуммаКРаспределению = 0
	КонецЦикла;//по наборам регистраторов
	Если СуммаКРаспределению <> 0 Тогда
		ЕстьОшибка = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#КонецЕсли