
#Область ПрограммныйИнтерфейс

Функция ЭтоРасширеннаяВерсияГосИС() Экспорт
	
	Возврат ОбщегоНазначенияИС.ЭтоРасширеннаяВерсияГосИС("ЕГАИС");
	
КонецФункции

Функция ИспользуетсяМаркируемаяПродукция() Экспорт
	
	Если ОбщегоНазначенияИС.ЭтоРасширеннаяВерсияГосИС("ЕГАИС") Тогда
		//@skip-check wrong-string-literal-content
		Возврат ПолучитьФункциональнуюОпцию("ВестиСведенияДляДекларацийПоАлкогольнойПродукции");
	Иначе
		Возврат ПолучитьФункциональнуюОпцию("ВестиСведенияДляДекларацийПоАлкогольнойПродукцииРМК");
	КонецЕсли;
	
КонецФункции

// см. ОбщегоНазначенияПереопределяемый.ПриПериодическомПолученииДанныхКлиентаНаСервере
Процедура ПриПериодическомПолученииДанныхКлиентаНаСервере(Параметры, Результаты) Экспорт
	
	ИменаПараметров = ОбщегоНазначенияЕГАИСКлиентСервер.ИменаПараметровПериодическогоПолученияДанных();
	
	Для Каждого КлючИЗначение Из Параметры Цикл
		
		ИмяПараметра      = КлючИЗначение.Ключ;
		ЗначениеПараметра = КлючИЗначение.Значение; // см. ОбщегоНазначенияЕГАИСКлиентСервер.НовоеЗначениеПараметраПериодическойОтправкиДанныхНаСерверЗапрос
		
		Если ИмяПараметра = ИменаПараметров.ОбновитьПараметрыНастроек Тогда
			
			Результат = ОбщегоНазначенияЕГАИСКлиентСервер.НовоеЗначениеПараметраПериодическойОтправкиДанныхНаСерверОтвет();
			Результат.ПараметрПриложения = ОбщегоНазначенияЕГАИСКлиентСервер.ПараметрПриложенияОбменНаКлиентеПоРасписанию();
			Результат.ПараметрПриложения.ЭтоВебКлиент = ОбщегоНазначения.ЭтоВебКлиент();
			
			Если Не (ОбщегоНазначения.РазделениеВключено()
				И Не ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных()) Тогда
					
				Результат.ПараметрПриложения.ВедетсяУчетАлкогольнойПродукции = ПолучитьФункциональнуюОпцию("ВестиСведенияДляДекларацийПоАлкогольнойПродукцииРМК");
				Если Результат.ПараметрПриложения.ВедетсяУчетАлкогольнойПродукции Тогда
					Результат.ПараметрПриложения.НастроенАвтоматическийОбмен = ОбменДаннымиЕГАИСВызовСервера.ДоступноВыполнениеОбменаНаКлиентеПоРасписанию();
				КонецЕсли;
				
			КонецЕсли;
			
			Если Не ЗначениеПараметра.НастроенАвтоматическийОбмен
				И Результат.ПараметрПриложения.НастроенАвтоматическийОбмен Тогда
				
				Результат.ДанныеДляВыполненияОбменаНаКлиенте = ОбменДаннымиЕГАИСВызовСервера.ВыполнитьОбмен(
					Неопределено,
					ЗначениеПараметра.ДатыПоследнегоЗапускаОбменаНаКлиентеПоРасписанию);
				Если Результат.ДанныеДляВыполненияОбменаНаКлиенте.ВыполнитьОбменПоРасписанию
					И Не Результат.ПараметрПриложения.ЭтоВебКлиент Тогда
					Результат.ВыполнитьОбменНаКлиенте = Истина;
				КонецЕсли;
				
			КонецЕсли;
			
			Результаты.Вставить(ИмяПараметра, Результат);
			
		ИначеЕсли ИмяПараметра = ИменаПараметров.ВыполнитьОбменДанными Тогда
			
			Результат = ОбщегоНазначенияЕГАИСКлиентСервер.НовоеЗначениеПараметраПериодическойОтправкиДанныхНаСерверОтвет();
			Результат.ДанныеДляВыполненияОбменаНаКлиенте = ОбменДаннымиЕГАИСВызовСервера.ВыполнитьОбмен(
				Неопределено,
				ЗначениеПараметра.ДатыПоследнегоЗапускаОбменаНаКлиентеПоРасписанию);
			Если Результат.ДанныеДляВыполненияОбменаНаКлиенте.ВыполнитьОбменПоРасписанию Тогда
				Результат.ВыполнитьОбменНаКлиенте = Истина;
			КонецЕсли;
			Результаты.Вставить(ИмяПараметра, Результат);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Помечает/снимает пометку удаления у приложенных файлов.
Процедура ПометитьНаУдалениеПрисоединенныеФайлыЕГАИС(Знач Источник, ДляОрганизацииЕГАИС = Ложь) Экспорт
	
	Если Источник.ЭтоНовый() Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИсточникСсылкаПометкаУдаления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Ссылка, "ПометкаУдаления");
	
	Если Источник.ПометкаУдаления = ИсточникСсылкаПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
	
	Если ДляОрганизацииЕГАИС Тогда
		ТекстЗапроса =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Файлы.Ссылка КАК Ссылка,
			|	Файлы.Редактирует КАК Редактирует
			|ИЗ
			|	Справочник.ЕГАИСПрисоединенныеФайлы КАК Файлы
			|ГДЕ
			|	Файлы.ВладелецФайла = &Ссылка
			|	И Файлы.Документ = НЕОПРЕДЕЛЕНО";
	Иначе
		ТекстЗапроса =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Файлы.Ссылка КАК Ссылка,
			|	Файлы.Редактирует КАК Редактирует
			|ИЗ
			|	Справочник.ЕГАИСПрисоединенныеФайлы КАК Файлы
			|ГДЕ
			|	Файлы.Документ = &Ссылка";
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Источник.ПометкаУдаления И ЗначениеЗаполнено(Выборка.Редактирует) Тогда
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '""%1"" не может быть удален,
				           |т.к. содержит присоединенный файл ""%2"",
				           |занятый для редактирования.'"),
				Строка(Источник.Ссылка),
				Строка(Выборка.Ссылка));
		КонецЕсли;
		ФайлОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ФайлОбъект.Заблокировать();
		ФайлОбъект.УстановитьПометкуУдаления(Источник.ПометкаУдаления);
	КонецЦикла;
	
КонецПроцедуры

// Возвращает режим записи документа.
//
// Параметры:
//  ДокументОбъект - ДокументОбъект - Документ.
// 
// Возвращаемое значение:
//  РежимЗаписиДокумента - Режим записи документа.
//
Функция РежимЗаписи(ДокументОбъект) Экспорт
	
	Возврат ?(ДокументОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись);
	
КонецФункции

// Возвращает общий префикс идентификатора для режима отладки.
// 
// Возвращаемое значение:
//  Строка - Общий префикс идентификатора режима отладки.
//
Функция ПрефиксИдентификатораРежимаОтладкиОбщий() Экспорт
	
	Возврат "1c-";
	
КонецФункции

// Возвращает префикс идентификатора для режима отладки.
// 
// Возвращаемое значение:
//  Строка - Префикс идентификатора режима отладки.
//
Функция ПрефиксИдентификатораРежимаОтладки() Экспорт
	
	ПрефиксИдентификатора = НРег(СокрЛП(ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("РежимОтладкиЕГАИС", "ПрефиксИдентификатора", "")));
	Если СтрДлина(ПрефиксИдентификатора) > 6 Тогда
		ПрефиксИдентификатора = Лев(ПрефиксИдентификатора, 6);
	КонецЕсли;
	Префикс = ПрефиксИдентификатораРежимаОтладкиОбщий() + ПрефиксИдентификатора + "-";
	
	Возврат Префикс;
	
КонецФункции

#КонецОбласти